[{"author":"Greg Bolte","email":"toyowheelin@gmail.com","website":"http:\/\/dannw.net","text":"One thing I noticed, you mention the stop forum spam website, however there is actually a mod developed for PHPBB which will automatically check new user registrations on the fly against the stop forum spam DB. This would be a better option on high visibility forums where there are a lot of legitimate users signing up. The details for the mods can be found on the stop forum spam site http:\/\/www.stopforumspam.com\/contributions","date":1294510380},{"author":"Callum Macrae","email":"callum@lynxphp.com","website":"http:\/\/lynxphp.com\/","text":"Thanks for linking me to that, I wasn’t aware there was a modification. I’ve been looking for an Akismet modification for a while, but I never thought of searching for this, I’ll check it out tomorrow.\r\n\r\n~Callum","date":1294511040},{"author":"neody","email":"yadinewbie@gmail.com","website":"http:\/\/biguniverse.co.cc\/forum","text":"thanks for your article.. but i'm tired to put question and answers..\r\n\r\nsorry for my bad english","date":1314866520},{"author":"Callum Macrae","email":"callum@lynxphp.com","website":"http:\/\/lynxphp.com\/","text":"@neody\r\n\r\nIs your board in English? If your board isn’t in English, then Q&A is by far the best CAPTCHA that you could use; the bots can only speak English, so they won’t be able to answer any questions in any other languages.\r\n\r\n~Callum","date":1314890580},{"author":"bdistler","email":"bob@bobdistler.com","website":"","text":"> Is your board in English? If your board isn’t in English, then Q&A is by far the best CAPTCHA that you could use; the bots can only speak English, so they won’t be able to answer any questions in any other languages.\r\n>\r\n> ~Callum\r\n\r\nDo not count on \"can only speak English\" most bolts today can and do work with more then one language.","date":1295689560},{"author":"Callum Macrae","email":"callum@lynxphp.com","website":"http:\/\/lynxphp.com\/","text":"As the majority of the Internet is in English and most of the money on the Internet is in America, more spam bots will target English speaking websites than other languages. In my experience, the Q&A captcha is less likely to be cracked if it is in a different language.\r\n\r\nOf course, the bots CAN be programmed to speak other languages, but they generally aren’t.\r\n\r\n~Callum","date":1295754720},{"author":"Philthy","email":"phil@skidvd.co.uk","website":"http:\/\/www.skidvd.co.uk\/phpbb\/index.php","text":"Not sure I agree that the majority of the internet is based in England, but that's not what this this is about.\r\nHave a look at this mod in development:\r\n<http:\/\/www.phpbb.com\/community\/viewtopic.php?f=70&t=2122138>\r\nI think you will agree, that it turns the tables on the spammers?","date":1298768520},{"author":"Callum Macrae","email":"callum@lynxphp.com","website":"http:\/\/lynxphp.com\/","text":"I meant English, fix’d\r\n\r\nThat mod looks pretty good, and I have heard quite a lot of recommendations for it :-D","date":1298940660},{"author":"Ya!Wego","email":"lewosin@gmail.com","website":"http:\/\/yawego.com","text":"how to prevent the spam forever?","date":1320401880},{"author":"Callum Macrae","email":"callum@lynxphp.com","website":"http:\/\/lynxphp.com\/","text":"Make sure you keep your board up to date, and change your questions occasionally, if you are using Q&A CAPTCHA.","date":1321661520}]
