[{"title":"JavaScript: Immediate Functions","slug":"javascript-immediate-functions","author":"callumacrae","date":1334325000,"tags":["javascript", "functions", "patterns"],"summary":"In JavaScript, the immediate function pattern is a way of executing a function as soon as it is defined. In this article, I will explain the syntax and explore some of the advantages of using it. This syntax can also be referred to as a closure."},{"title":"Security: SQL Injections","slug":"security-sql-injections","author":"callumacrae","date":1331919840,"tags":["security"],"summary":"SQL injection is a common, although becoming less so, type of vulnerability that is occasionally found in websites that use SQL (Server Query Language) to access data at the server-side. If the code used to query the database doesn't correctly escape the data passed to it, it may be vulnerable. This article will explain the vulnerability, and then explain how to secure your code against it."},{"title":"Security: Cross-Site Scripting (XSS)","slug":"cross-site-scripting","author":"callumacrae","date":1331489400,"tags":["security"],"summary":"Cross-site scripting is a type of vulnerability that affects a surprisingly large number of websites, allowing an attacker to inject HTML into the website. Usually, this would be an iframe or a script, both of which can be dangerous. This article will explore the vulnerability and how you can secure your site against it."},{"title":"Rumour Debunked: Single quotes vs double quotes in PHP","slug":"single-quotes-vs-double-quotes","author":"callumacrae","date":1325788320,"tags":["php"],"summary":"There is a popular rumour that while writing PHP, you should use double quotes wherever possible. This used to be true - before PHP 5.1 was released, there was a significant difference in speed between double and single quotes, and it was definitely a good idea to use single quotes wherever possible. PHP 5.1 included some optimisations to the opcode parser which improved the double quotes parsing time, and since then, using double quotes hasn't been an issue."},{"title":"What are SSL certificates and where should I get one?","slug":"what-are-ssl-certificates-where-should-i-get-one","author":"olie122333","date":1324497180,"tags":["security", "ssl", "certificates"],"summary":"SSL certificates also ensure the integrity of the server that the user is connecting to, as the certificate should be signed by a Certification Authority (CA) which the user’s browser trusts, acting as a guarantor of the server’s integrity."},{"title":"Awesome CSS3 generators","slug":"awesome-css3-generators","author":"olie122333","date":1324479420,"tags":["css3", "design"],"summary":"CSS3 generators make a web developer's life so much easier, particularly if you don't use the properties very often. Here, I have gathered some of my favourite generators."},{"title":"IO: Accepting command line input in PHP","slug":"io-accepting-command-line-input-in-php","author":"callumacrae","date":1321987080,"tags":["php", "cli", "io", "stdin"],"summary":"While writing an application, you may sometimes feel the need to create a script that can communicate with the user through the command line – perhaps you don't feel the need to write an entire web GUI for your install script, or you just want to experiment."},{"title":"How version control can benefit you and your project","slug":"how-version-control-can-benefit-you-and-your-project","author":"callumacrae","date":1309434540,"tags":["svn", "git", "version control"],"summary":"You may have heard of version control (sometimes called revision control or source control), or you may have even used it briefly before, but never actually used it as part of a project. Some examples of version control systems are Git (my personal favourite), SVN and Mercurial. In this article I will explain how the use of one of these version control systems can benefit your project."},{"title":"Method Chaining in PHP","slug":"method-chaining-in-php","author":"callumacrae","date":1307182920,"tags":["php", "method chaining", "oop"],"summary":"Method chaining allows for shorter and cleaner code, and in this article I will explain how it is possible in PHP."},{"title":"A basic BBCode parser","slug":"a-basic-bbcode-parser","author":"callumacrae","date":1307012040,"tags":["php", "bbcode", "parsing", "preg_match", "regex"],"summary":"In this article I will show you and explain to you the basic BBCode parser I have built recently for one of my projects. It is lightweight and easy to modify, as it just uses regex."},{"title":"Utilising the MVC architecture","slug":"mvc-architecture","author":"callumacrae","date":1303036920,"tags":["php", "architecture", "mvc"],"summary":"The Model-View-Controller (MVC) architecture is an architecture most commonly used to separate what is known as \"domain logic\" - the code that powers the backend - from the user interface - what the user sees. This makes your code clearer, easier to work with, and has the advantage that you can very easily had multiple people working on the same project without conflicts, and without the need for a version control software such as Git or SVN."},{"title":"Integrating phpBB sessions into your site","slug":"integrating-phpbb-sessions","author":"callumacrae","date":1302434340,"tags":["logins", "sessions", "phpbb"],"summary":"Instead of having two logins to your site, it would be far easier and more efficient to use phpBB's sessions systems. It would also be easier for your users and more secure. You will also be able to use stuff like the permissions system and the templates system if you wish. In this article, I will explain how you can integrate the phpBB session into your website."},{"title":"Why I use IE6","slug":"april-fools","author":"callumacrae","date":1301651040,"tags":["internet explorer", "april fools"],"summary":"I've taken some time out from coding to write about one of my favourite pieces of software: Internet Explorer 6! This ancient piece of software is still going strong; over the years, it has repeatedly proven itself to be the best browser available. I mean, it's been around since 2001 - it's proven technology!"},{"title":"An introduction to the lynx-framework","slug":"an-introduction-to-the-lynx-framework","author":"callumacrae","date":1300209720,"tags":["lynx-framework", "security", "speed"],"summary":"I'm currently writing a framework, called (suitably) the lynx-framework. Written in PHP, it is designed to be a framework for social networks. It will include plugins that are perfect for social networks, such as authentication, a news feed, profiles, messages, etc. Any part can be enabled or disabled, making it extremely easy to build any sort of social network."},{"title":"Dynamic styles using PHP and Cookies","slug":"dynamic-styles-using-php-and-cookies","author":"galaxyAbstractor","date":1300042800,"tags":["php", "css", "dynamic", "style"],"summary":"Ever wondered how you can let your visitors customize your sites design in various ways? It can very easily be done with PHP and cookies. Having dynamic styles could add functionality like adjusting text size, color or background color etc."},{"title":"Protecting your code with Obfuscation and Licenses","slug":"protecting-code-obfuscation-licenses","author":"callumacrae","date":1297534320,"tags":["php", "licenses", "obfuscation", "protecting code"],"summary":"If you're going to be releasing your code, you will want to protect your code, to stop people from releasing it as their own work or to make sure they leave you name at the bottom of it. Obfuscation and Licensing are two ways you can do this, and we're going to look at both in this article."},{"title":"Hosting your website","slug":"hosting-your-website","author":"callumacrae","date":1296674040,"tags":["hosting", "free hosting", "server", "shared", "vps"],"summary":"There are many ways your can host your website, and some of them may seem quite complicated. In this article, I aim to clear up the various methods and help you decide which method is best for you. I will also give you some basic tips on finding a good host."},{"title":"Optimising your website for mobile devices","slug":"optimising-website-mobile-devices","author":"callumacrae","date":1296506820,"tags":["php", "mobile", "optimisation", "preg_match", "theme"],"summary":"Mobile phones are being used to access the Internet with increasing frequency, and as more people buy better phones and mobile Internet gets cheaper, we will find our websites being hit by a greater number of mobile devices. Only one problem: your huge, image heavy design on your forums or blog takes several minutes to load due to slow network speeds, and even then, it uses more resources than the phone has and goes off the screen. Solution? Get a mobile website."},{"title":"Creating a (very) basic image upload script using Codeigniter","slug":"codeigniter-image-upload-script","author":"callumacrae","date":1295129520,"tags":["php", "scripts", "codeigniter", "image upload"],"summary":"In this article I will show you a very basic image upload script I wrote using Codeigniter. I will also show you how it works, and suggest how it could be improved. Feel free to take the code from here and adapt it for your own website."},{"title":"Updates","slug":"updates-jan2011","author":"callumacrae","date":1295071201,"tags":["news"],"summary":"Two weeks ago, on the 1st of January '11 at 01:01:01, lynxphp opened. As lynxphp has been more successful than I first hoped, I've made a few changes."},{"title":"Using eval() properly","slug":"eval-properly","author":"callumacrae","date":1295071200,"tags":["php","eval","security"],"summary":"eval() is a PHP function that allows the user to execute a string as PHP code. In this function I will explore when the right and wrong times to use eval are."},{"title":"What software should I use for my website?","slug":"software-website","author":"callumacrae","date":1294984800,"tags":["scripts","phpbb","html","smf","wordpress"],"summary":"That is one question which I often hear asked more than once a day, along with \"What's the best CMS\" and \"What's the best forum software?\". The answer for all three is the same (they are, after all, basically the same question); it depends on what you need. What's good for me might not be good for you, and what's good for a professional web developer will usually not be good for a 14 year old with no development experience."},{"title":"Using mod_rewrite to create friendlier URLs","slug":"mod_rewrite-create-friendlier-urls","author":"callumacrae","date":1294898400,"tags":["php","seo","mod_rewrite"],"summary":"mod_rewrite is an Apache module used for rewriting a URL at the server level, making the URL a lot friendlier. For example, if a user goes to example.com\/article\/421 they will in fact be shown example.com\/article.php?id=421, but they still think they're accessing \/article\/421. This is a different to redirect, as a redirect completely changes the page the user is on, telling them that they're on article.php, but mod_rewrite does not - this makes the URL look a lot friendlier, while not requiring millions of pages."},{"title":"Bad Coding Practices to Avoid","slug":"bad-coding-practices-to-avoid","author":"callumacrae","date":1294812000,"tags":["php","coding practice","comments","spacing","rant"],"summary":"One of most annoying things I have to face when coding is other people's bad code. I consider my own coding standard to be fairly good, but sometimes I have to work with code that hasn’t been coded well at all. Messy code is difficult to read, difficult to work with, and it can also slow your code down."},{"title":"Running PHP applications from the command line","slug":"running-php-applications-command-line","author":"callumacrae","date":1294725600,"tags":["php","cli"],"summary":"I've always found it useful to be able to run PHP applications from the command line: not only does it allow me to quickly view the output of my code from the command line - where I do the majority of my developing - but it also allows me to make proper command line applications from within PHP. Okay, quite a lot of stuff is not possible, but it's still fun. This applies to Unix only, I believe."},{"title":"How to set up a PHP\/MySQL Server on Windows","slug":"set-phpmysql-server-windows","author":"samhaines","date":1294639200,"tags":["server","php","mysql","install"],"summary":"In this tutorial I will describe the process of configuring a PHP and MySQL server on a Windows computer with running the Apache Web Server version 2.2. This configuration is ideal for developing websites on your own computer, without the need for a server."},{"title":"PHP array functions","slug":"php-array-functions","author":"callumacrae","date":1294552800,"tags":["php","functions","array"],"summary":"There are a huge amount of functions to deal with arrays in PHP, but I will be going through just a few of the most useful or interesting ones. If you would like me to add a function or two to this list, just tell me and I'll do my best."},{"title":"Preventing and dealing with spam in phpBB","slug":"preventing-and-dealing-with-spam-in-phpbb","author":"callumacrae","date":1294466400,"tags":["phpbb","spam"],"summary":"A couple days ago, the amount of spam being posted to my phpBB forum increased dramatically. I turned to the phpBB.com community forums and made my thread, and it looks like it's happening to many other people using the Q&amp;A CAPTCHA. The Q&A CAPTCHA was added to phpBB in 3.0.6, and it allowed the board administrator to specify a question that the user had to answer on sign-up. In this article, I will explain how you can attempt to prevent them from damaging your board or hacking into your users' accounts."},{"title":"The five best modifications for phpBB","slug":"modifications-phpbb","author":"callumacrae","date":1294380000,"tags":["phpBB","modifications"],"summary":"Modifications are a way of customising your phpBB board. They can do anything, from adding a new feature, to changing an already existing feature, to completely removing a feature! \"Modifications\" is often shortened to \"MODs\". In this article I will be explaining what I think the best modifications for phpBB are and why."},{"title":"The If Shortcut: The Ternary Operator","slug":"shortcut-ternary-operator","author":"callumacrae","date":1294293600,"tags":["php","shortcuts"],"summary":"The ternary operator is a shortcut comparison operator that replaces an if-else statement in a PHP script. If you use a lot of if-else statements in your scripts, using the ternary operator can shorten your code hugely. The ternary operator is very simple to use, but it does tend to confuse new PHP programmers."},{"title":"What are regular expressions?","slug":"regular-expressions","author":"samhaines","date":1294207200,"tags":["php","regex"],"summary":"Regular expressions are a way for programs to search for a  particular pattern in a string. For example, they can be used to find strings starting with \"www.\", or to see if some user input is a valid email. Regular expressions are incredibly useful for validating user input and also for the mod_rewrite function of the Apache server."},{"title":"Preventing DDoS","slug":"preventing-ddos","author":"callumacrae","date":1294120800,"tags":["server","attack","ddos","security"],"summary":"Following the recent (largely successful) attacks by Anonymous Operation on more than a few websites including Paypal, Mastercard and Visa, a few people asked me if they were at risk of being attacked and how they could prevent it. In this article, I will explain various ways of stopping DDoS, and whether they actually work or not."},{"title":"Using preg_replace as a word censor or for smilies","slug":"preg_replace-word-censor-smilies","author":"callumacrae","date":1294034400,"tags":["php","scripts","preg_replace","regex"],"summary":"In this article I will be demonstrating a basic word censor \/ smilie parser that you can use on your website. Firstly I will give you the code, then I will explain how to use it, then I will tell you how it works."},{"title":"Working with date and time","slug":"working-with-date-and-time","author":"callumacrae","date":1293948000,"tags":["functions","php","date","time"],"summary":"There are many function in PHP for working with date and time. In this article, I will be explaining the most commonly used ones."},{"title":"Ultimate Guide to .htaccess","slug":"ultimate-guide-htaccess","author":"callumacrae","date":1293865263,"tags":["apache","blocking","error documents","htaccess","redirect"],"summary":"The .htaccess file is a text file that contains Apache directives. Any directives you place in it will apply to the directory that contains the htaccess and also any directories below it. htaccess is extremely powerful, and has many functions. Some of the main functions include custom error pages, password protection of directories and files, rewriting of URLs, and more, and in this article I will explain how to use htaccess."},{"title":"Sleeping in PHP","slug":"sleeping-php","author":"callumacrae","date":1293865262,"tags":["functions","php","sleep"],"summary":"I've seen a few people asking how they can sleep or pause their PHP script, so in this article I am going to do two things - I am going to explain how you can sleep your script in PHP, and I am also going to ask this question: Why would you want to?"},{"title":"PHP Data Objects (PDO) - The Basics","slug":"pdo-basics","author":"callumacrae","date":1293865261,"tags":["php","database","mysql","pdo","sql"],"summary":"PHP Data Objects (PDO) is an extension for PHP that provides the developer with yet another way to access databases using SQL in PHP. This is the first half of a two-part tutorial. In this part, I will explain how to connect to, select rows from, and insert data into a database; in the next part, I will cover some more advanced stuff."},{"title":"Hello world!","slug":"hello-world","author":"callumacrae","date":1293865260,"tags":["news"],"summary":"Welcome to lynxphp! I’m Callum Macrae, administrator of lynxphp and a PHP developer. I’ve been around for a while, but I’ve never actually contributed anything to the developer community, so I thought I would start this website to share my knowledge (and to help myself learn new stuff)!"}]