[
	{
		"title": "Running PHP applications from the command line",
		"slug": "php-from-cli",
		"author": "callumacrae",
		"date": 1294725600,
		"tags": ["php", "cli"],
		"summary": "I've always found it useful to be able to run PHP applications from the command line: not only does it allow me to quickly view the output of my code from the command line - where I do the majority of my developing - but it also allows me to make proper command line applications from within PHP. Okay, quite a lot of stuff is not possible, but it's still fun. This applies to Unix only, I believe."
	},
	{
		"title": "How to set up a PHP/MySQL Server on Windows",
		"slug": "set-phpmysql-server-windows",
		"author": "samhaines",
		"date": 1294639200,
		"tags": ["server", "php", "mysql", "install"],
		"summary": "In this tutorial I will describe the process of configuring a PHP and MySQL server on a Windows computer with running the Apache Web Server version 2.2. This configuration is ideal for developing websites on your own computer, without the need for a server."
	},
	{
		"title": "PHP array functions",
		"slug": "php-array-functions",
		"author": "callumacrae",
		"date": 1294552800,
		"tags": ["php", "functions", "array"],
		"summary": "There are a huge amount of functions to deal with arrays in PHP, but I will be going through just a few of the most useful or interesting ones. If you would like me to add a function or two to this list, just tell me and I'll do my best."
	},
	{
		"title": "Preventing and dealing with spam in phpBB",
		"slug": "preventing-and-dealing-with-spam-in-phpbb",
		"author": "callumacrae",
		"date": 1294466400,
		"tags": ["phpbb", "spam"],
		"summary": "A couple days ago, the amount of spam being posted to my phpBB forum increased dramatically. I turned to the phpBB.com community forums and made my thread, and it looks like it's happening to many other people using the Q&A CAPTCHA. The Q&A CAPTCHA was added to phpBB in 3.0.6, and it allowed the board administrator to specify a question that the user had to answer on sign-up. In this article, I will explain how you can attempt to prevent them from damaging your board or hacking into your users' accounts."
	},
	{
		"title": "The five best modifications for phpBB",
		"slug": "best-modifications-phpbb",
		"author": "callumacrae",
		"date": 1294380000,
		"tags": ["phpBB", "modifications"],
		"summary": "Modifications are a way of customising your phpBB board. They can do anything, from adding a new feature, to changing an already existing feature, to completely removing a feature! \"Modifications\" is often shortened to \"MODs\". In this article I will be explaining what I think the best modifications for phpBB are and why."
	},
	{
		"title": "The If Shortcut: The Ternary Operator",
		"slug": "ternary-operator",
		"author": "callumacrae",
		"date": 1294293600,
		"tags": ["php", "shortcuts"],
		"summary": "The ternary operator is a shortcut comparison operator that replaces an if-else statement in a PHP script. If you use a lot of if-else statements in your scripts, using the ternary operator can shorten your code hugely. The ternary operator is very simple to use, but it does tend to confuse new PHP programmers."
	},
	{
		"title": "What are regular expressions?",
		"slug": "regular-expressions",
		"author": "samhaines",
		"date": 1294207200,
		"tags": ["php", "regex"],
		"summary": "Regular expressions are a way for programs to search for a  particular pattern in a string. For example, they can be used to find strings starting with \"www.\", or to see if some user input is a valid email. Regular expressions are incredibly useful for validating user input and also for the mod_rewrite function of the Apache server."
	},
	{
		"title": "Preventing DDoS",
		"slug": "preventing-ddos",
		"author": "callumacrae",
		"date": 1294120800,
		"tags": ["server", "attack", "ddos", "security"],
		"summary": "Following the recent (largely successful) attacks by Anonymous Operation on more than a few websites including Paypal, Mastercard and Visa, a few people asked me if they were at risk of being attacked and how they could prevent it. In this article, I will explain various ways of stopping DDoS, and whether they actually work or not."
	},
	{
		"title": "Using preg_replace as a word censor or for smilies",
		"slug": "preg_replace-word-censor-smilies",
		"author": "callumacrae",
		"date": 1294034400,
		"tags": ["php", "scripts", "preg_replace", "regex"],
		"summary": "In this article I will be demonstrating a basic word censor / smilie parser that you can use on your website. Firstly I will give you the code, then I will explain how to use it, then I will tell you how it works."
	},
	{
		"title": "Working with date and time",
		"slug": "working-with-date-and-time",
		"author": "callumacrae",
		"date": 1293948000,
		"tags": ["functions", "php", "date", "time"],
		"summary": "There are many function in PHP for working with date and time. In this article, I will be explaining the most commonly used ones."
	},
	{
		"title": "Ultimate Guide to .htaccess",
		"slug": "ultimate-guide-htaccess",
		"author": "callumacrae",
		"date": 1293865263,
		"tags": ["apache", "blocking", "error documents", "htaccess", "redirect"],
		"summary": "The .htaccess file is a text file that contains Apache directives. Any directives you place in it will apply to the directory that contains the htaccess and also any directories below it. htaccess is extremely powerful, and has many functions. Some of the main functions include custom error pages, password protection of directories and files, rewriting of URLs, and more, and in this article I will explain how to use htaccess."
	},
	{
		"title": "Sleeping in PHP",
		"slug": "sleeping-php",
		"author": "callumacrae",
		"date": 1293865262,
		"tags": ["functions", "php", "sleep"],
		"summary": "I've seen a few people asking how they can sleep or pause their PHP script, so in this article I am going to do two things - I am going to explain how you can sleep your script in PHP, and I am also going to ask this question: Why would you want to?"
	},
	{
		"title": "PHP Data Objects (PDO) - The Basics",
		"slug": "pdo-basics",
		"author": "callumacrae",
		"date": 1293865261,
		"tags": ["php", "database", "mysql", "pdo", "sql"],
		"summary": "PHP Data Objects (PDO) is an extension for PHP that provides the developer with yet another way to access databases using SQL in PHP. This is the first half of a two-part tutorial. In this part, I will explain how to connect to, select rows from, and insert data into a database; in the next part, I will cover some more advanced stuff."
	},
	{
		"title": "Hello world!",
		"slug": "hello-world",
		"author": "callumacrae",
		"date": 1293865260,
		"tags": ["news"],
		"summary": "Welcome to lynxphp! I’m Callum Macrae, administrator of lynxphp and a PHP developer. I’ve been around for a while, but I’ve never actually contributed anything to the developer community, so I thought I would start this website to share my knowledge (and to help myself learn new stuff)!"
	}
]
